Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОбДоговорахИДокументах</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьСозданиеАктов(Команда)    
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда 
		
		Текст = "Необходимо заполнить период";
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	ОчиститьСообщения();
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Дата",Объект.Период); 
	
	ДлительнаяОперация = ЗапуститьДлительнуюОперацию(Объект.Период, УникальныйИдентификатор);  
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСозданиеАктовЗавершение",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Оповещение);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция  ЗапуститьДлительнуюОперацию(ПараметрыЗапуска, УникальныйИдентификатор)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Документы.РеализацияТоваровУслуг.ВКМ_МассовоеСозданиеАктов",ПараметрыЗапуска);
	
КонецФункции 

&НаКлиенте
Процедура  ВыполнитьСозданиеАктовЗавершение(Результат,ДополнительныеПараметры)Экспорт 
	
	Если Результат = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда 
		
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
		
	КонецЕсли; 
	
	РезультатВычилений = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	
	Объект.ДанныеОбДоговорахИДокументах.Очистить();

	Для Каждого Строка Из РезультатВычилений Цикл  
		
		
	ДаныеТЧ = Объект.ДанныеОбДоговорахИДокументах.Добавить();	
	ДаныеТЧ.Договор = Строка.Договор;
	ДаныеТЧ.Документ = Строка.Документ;
	
	КонецЦикла;
		
КонецПроцедуры
#КонецОбласти
